legacy/tutorials/cavityFSI/fluid/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application pimpleFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime 70;

deltaT 0.01;

writeControl runTime;

writeInterval 0.10;

purgeWrite 0;

writeFormat ascii;

writePrecision 14;

writeCompression uncompressed;

timeFormat general;

timePrecision 8;

runTimeModifiable no;

adjustTimeStep no;

maxCo 0.2;

functions
{
    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
}

